import re
# Найти самое длинное слово в строке.
a = str(input('Введите предложение: '))
print(max(a.split(), key = len))

#Преобразовать текст в список слов с удалением знаков препинания.
b = input('Введите текс со знаками препинания: ')
print(re.findall('\w+', b))