a = (13, 5, 43, 49, 67, 32, 12, 98, 6, 10, 34, 20, 55, 68, 14, 60, 14)
b = (53, 21, 4, 23, 76, 3, 43, 12, 54, 342, 21)
# 1) Сумма элементов какого из кортежей больше и вывести соответствующее сообщение на экран ( Сумма больше в кортеже - ..)
e = 'a' if sum(a) > sum(b) else 'b'
print(f'Сумма больше в кортеже - {e};', 'Сумма кортежа a -', sum(a), 'Сумма кортежа b -', sum(b))
# 2) Вывести на экран порядковые номера минимальных элементов этих кортежей
print(f'Порядковый номер минимального элемента кортежа a - ', a.index(min(a)) + 1)
print(f'Порядковый номер минимального элемента кортежа b - ', b.index(min(b)) + 1)