# Вывести данные кортежа без скобок, через запятую. Обязательно: элементы кортежа – строки.
coins = (15, 'строка', [2, 10], 'ещё строка', 200)
print(', '.join(str(i) for i in coins[0:]))